# Вивести в консоль довжину, ширину, периметр і кількість сажанців
# 1 метр квадратний - 4 сажанці
n = int(input("Введіть кількість ділянок:"))
data = []
for i in range(n):
    print(f"\nВведіть параметри для клумби {i + 1}")
    a = float(input(" Введіть довжину клумби в метрах: "))
    b = float(input(" Введіть ширину клумби в метрах: "))
    perimetr = 2 * (a + b)
    seedlings = a * b * 4
    data.append([a,b, perimetr, seedlings])

print("+--------------+-------------+-------------+--------------------+")
print("| Довжина (м)  | Ширина(м)   | Огорожа(м)  | Кількість саджанців|")
for row in data:
    print(f"| {row[0]:<12} | {row[1]:<11} | {row[2]:<12} | {row[3]:<17} |")
    print("+--------------+-------------+-------------+--------------------+")